In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df= pd.read_csv(r'C:\Users\vyshn\Downloads\Real_Estate.csv')

In [3]:
df.head()

,Transaction date,House age,Distance to the nearest MRT station,Number of convenience stores,Latitude,Longitude,House price of unit area
0,2012-09-02 16:42:30.519336,13.3,4082.0150,8,25.007059,121.561694,6.488673
1,2012-09-04 22:52:29.919544,35.5,274.0144,2,25.012148,121.546990,24.970725
2,2012-09-05 01:10:52.349449,1.1,1978.6710,10,25.003850,121.528336,26.694267
3,2012-09-05 13:26:01.189083,22.2,1055.0670,5,24.962887,121.482178,38.091638
4,2012-09-06 08:29:47.910523,8.5,967.4000,6,25.011037,121.479946,21.654710

In [4]:
df.isna().sum()

Transaction date                       0
House age                              0
Distance to the nearest MRT station    0
Number of convenience stores           0
Latitude                               0
Longitude                              0
House price of unit area               0
dtype: int64

In [5]:
df['Number of convenience stores'].describe()

count    414.000000
mean       4.265700
std        2.880498
min        0.000000
25%        2.000000
50%        5.000000
75%        6.750000
max       10.000000
Name: Number of convenience stores, dtype: float64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 414 entries, 0 to 413
Data columns (total 7 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   Transaction date                     414 non-null    object
 1   House age                            414 non-null    float64
 2   Distance to the nearest MRT station  414 non-null    float64
 3   Number of convenience stores         414 non-null    int64
 4   Latitude                             414 non-null    float64
 5   Longitude                            414 non-null    float64
 6   House price of unit area             414 non-null    float64
dtypes: float64(5), int64(1), object(1)
memory usage: 22.8+ KB

In [7]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
import datetime

In [9]:
df['Transaction date'] = pd.to_datetime(df['Transaction date'])
df['Transaction year'] = df['Transaction date'].dt.year
df['Transaction month'] = df['Transaction date'].dt.month

In [10]:
df.head()

,Transaction date,House age,Distance to the nearest MRT station,Number of convenience stores,Latitude,Longitude,House price of unit area,Transaction year,Transaction month
0,2012-09-02 16:42:30.519336,13.3,4082.0150,8,25.007059,121.561694,6.488673,2012,9
1,2012-09-04 22:52:29.919544,35.5,274.0144,2,25.012148,121.546990,24.970725,2012,9
2,2012-09-05 01:10:52.349449,1.1,1978.6710,10,25.003850,121.528336,26.694267,2012,9
3,2012-09-05 13:26:01.189083,22.2,1055.0670,5,24.962887,121.482178,38.091638,2012,9
4,2012-09-06 08:29:47.910523,8.5,967.4000,6,25.011037,121.479946,21.654710,2012,9

In [11]:
df = df.drop('Transaction date', axis=1)

In [12]:
X = df.drop('House price of unit area', axis=1)
y = df['House price of unit area']

In [13]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [14]:
scaler = StandardScaler()
scaled_X_train = scaler.fit_transform(X_train)
scaled_X_test = scaler.transform(X_test)

In [16]:
scaled_X_test.shape

(83, 7)

In [17]:
scaled_X_train.shape

(331, 7)

In [18]:
from sklearn.linear_model import LinearRegression
from sklearn.ensemble import RandomForestRegressor, GradientBoostingRegressor
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_absolute_error, r2_score

In [20]:
models = {"Linear Regression":LinearRegression(),
          "Decision tree" : DecisionTreeRegressor(random_state=42),
         "Random Regressor": RandomForestRegressor(random_state=42),
         "Gradient Boosting": GradientBoostingRegressor(random_state=42)}

In [21]:
results = {}

In [27]:
for name, model in models.items():
    model.fit(scaled_X_train, y_train)
    
    predictions = model.predict(scaled_X_test)
    
    mae = mean_absolute_error(y_test, predictions)
    r2 = r2_score(y_test, predictions)
    
    results[name] = {"MAE":mae, "R2": r2}
    
results_df= pd.DataFrame(results)
results_df.T

                         MAE        R2
Linear Regression   9.748246  0.529615
Decision tree      11.760342  0.204962
Random Regressor    9.887601  0.509547
Gradient Boosting  10.000117  0.476071